Repository: lf-j/Open-Source-Guides-For-The-Enterprise
Catalog: RecruitingDevelopers/tm/Trial-level1.tmx
Source language: en_us
Languages: ja

source: Once you’ve identified great or even good developers working internally or externally in project communities that are important to you, ask for their wish list of co-workers and target those people for recruitment too.
ja: プロジェクトのコミュニティーにおいて、社内外の優れた、あるいは良いデベロッパーを特定した場合、彼らが一緒に働きたいという人材のリストを作成し、その人材も採用候補に加えます。

source: One of the biggest challenges with open source recruiting is that open source projects transcend company boundaries.
ja: オープンソース分野での採用における最も大きな課題の一つとして、オープンソース プロジェクトがその性質上、企業間の壁を越えて広がっていくという点が挙げられます。

source: Open Source Community Manager
ja: オープンソース コミュニティ マネージャー

source: Open source as a recruitment tool
ja: 採用ツールとしてのオープンソース

source: Open source developers — that is, developers with significant open source experience — are a subset of this population.
ja: オープンソース デベロッパー （オープンソースにおける充分な経験を持ったデベロッパー）は、この母集団の一部です。

source: Open source is at the heart of almost all technologies now, therefore it should be a part of most technology job descriptions.
ja: 現在においては、オープンソースはほぼすべてのテクノロジーの中心に位置づけられているため、ほぼすべてのテクノロジー関連の職種における職務内容の一部として記載されるべきです。

source: Open source projects are usually more receptive to outside help and manage two versions of their code, one that is more stable and one that is open to constant activity.
ja: 一方、オープンソース プロジェクトにおいては外部からの貢献を積極的に受け入れることが多く、より安定したコードと常に変更が行われているコードの2バージョンを管理します。

source: Open source your own code, create small pilot projects, and iterate on success.
ja: 自社のコードをオープンソース化し、小さなパイロットプロジェクトを立ち上げ、成功体験を反復せよ。

source: Or maybe you already employ a top developer on a key project, who then moves on to another opportunity and there isn’t sufficient time available to groom someone to take their place.
ja: あるいは、主要プロジェクトのためにトップクラスのデベロッパーをすでに採用していたものの転職されてしまい、代わりの人材を育成する時間がない場合もあります。

source: Our engineers know that they work in an open source friendly environment where they are supported and encouraged to work with the open source communities that are relevant to their work.”
ja: 我々のエンジニアは、自分達がオープンソースにフレンドリーな環境で働いていて、自らの業務に関連するオープンソースコミュニティーに携わることを奨励され、必要なサポートを受けられるということを理解しています

source: Participate and grow leadership in open source projects
ja: 1. オープンソース プロジェクトに参加し、リーダーシップを確立する。

source: Participate in open source events.
ja: 5. オープンソースのイベントに参加する。

source: Participating companies include Autodesk, Comcast, Dropbox, Facebook, Google, Intel, Microsoft, Netflix, Oath (Yahoo + AOL), Red Hat, Salesforce, Samsung and VMware.
ja: 参加企業一覧：Autodesk、Comcast、 Dropbox、Facebook、Google、Intel、Microsoft、Netflix、Oath (Yahoo + AOL)、Red Hat、Salesforce、Samsung、VMware。

source: Participating in open source communities is the first, and most important thing you can do to attract open source developers.
ja: オープンソース デベロッパーを獲得する際にまず行うべきである最も重要なことは、オープンソース コミュニティーへの参加です。

source: Participating in open source projects takes a good understanding of community dynamics and a bit of experience.
ja: オープンソース プロジェクトへの参加には、コミュニティーに作用する力学の理解と、ほんの少しの経験が必要です。

source: Participating in projects that match your future needs may help you get ahead in acquiring talent for your next projects.
ja: 将来的に必要となるプロジェクトに参加することにより、次期プロジェクトに必要となる人材の確保が容易になる可能性があります。

source: Pay developers to contribute and set aside time to work on open source.
ja: デベロッパーのオープンソースへの貢献や、そのための時間を割く行為に対して対価を支払う。

source: Perhaps the biggest surprise to employers is that the unique nature of open source developers and their movement between companies in a single project is as beneficial to their various employers as it is to the developers.
ja: 雇用者にとって一番の驚きは、オープンソース デベロッパー独特の同一プロジェクト内における転職が、当のデベロッパーだけでなく各雇用者にとっても、同じぐらいメリットがあるということかも知れません。

source: Provide proper IT infrastructure that will allow your developers to comunicate and work with the global open source community without any challenges.
ja: 6. デベロッパーがグローバルなオープンソース コミュニティーと制約なしで交流するために必要なITインフラを提供する。

source: Purpose: A highly visible, challenging, and measurable goal.
ja: 目的：目に見える、チャレンジングで測定可能な目標。

source: Recruit established developers
ja: 経験豊富なデベロッパーの採用

source: Recruit or train?
ja: 採用か育成か？

source: Recruiting Open Source Developers
ja: オープンソース デベロッパーの採用

source: Recruiting established developers must be part of your plan.
ja: 経験豊富なデベロッパーの採用は、貴社の計画に必ず織り込む必要があります。

source: Recruiting from this group can result in a mutually perfect match.
ja: そこで採用活動を行うことで、企業とデベロッパーの双方にとって最適の組み合わせとなる可能性があります。

source: Recruiting them, if you can, will help you build your internal open source culture and attract other top-notch developers.
ja: それらの人材を採用することができれば、貴社内におけるオープンソース文化の醸成や、他のトップクラスのデベロッパーの採用に寄与することでしょう。

source: Regardless of your strategy, there are two basic approaches to building open source talent within your organization: Recruit and train.
ja: 貴社の戦略がどのようなものであっても、オープンソースの人材を充実させるための手法は、基本的に採用と育成の二つに集約されます。

source: Remember that influence follows the person, and not the company they work for.
ja: この場合、影響力は人材に帰属するもので、雇用主に帰属するものではないということを忘れてはなりません。

source: Respect: This is less tangible, but no less real, and is often pinned to professional recognition.
ja: 敬意：無形ではあるものの確かに存在する概念であり、一般的にはプロフェッショナルとしての認知に関連付けられる。

source: Rewards: Everything from salary to benefits and perks.
ja: 報酬：給与・福利厚生・その他特典を含むすべて。

source: Section 1
ja: セクション1

source: Section 2
ja: セクション2

source: Section 3
ja: セクション3

source: Section 4
ja: セクション4

source: Section 5
ja: セクション5

source: Send developers to present at conferences and events
ja: デベロッパーをカンファレンスやイベントに送り込み、プレゼンテーションを行わせる。

source: Send your developers and support them in presenting their work.
ja: デベロッパーを送り込み、作業内容の発表をサポートする。

source: Senior Director, Open Source
ja: オープンソース シニアディレクター

source: Senior Director, Open Source Practice
ja: オープンソース プラクティス シニアディレクター

source: Senior and more experienced developers help junior and less experienced ones in resolving technical problems as needed and aid with training in open source methodology and open source culture.
ja: より多くの経験を有するシニア デベロッパーが、必要に応じて、経験の少ない若手デベロッパーの技術的課題の解決やオープンソースの手法や文化に関するトレーニングを支援します。

source: Set up a mentorship program where senior and more experienced developers guide junior, less experienced ones.
ja: 3. 経験豊富なデベロッパーが、より経験の少ないデベロッパーを育成するメンター制度を策定する。

source: Set up an internal system to track the contributions of your developers and measure their impact.
ja: 7. デベロッパーの貢献度をトラックングする社内システムを構築し、影響度を測定する。

source: Show them you are serious about open source and you’ll get people who can help maintain, contribute to, or even be committers on your most important projects.
ja: 貴社のオープンソースに対する本気度を示せば、貴社の最重要プロジェクトにおいてもメンテナー、貢献者、あるいはコミッターとして活躍してくれる人材を獲得することができるでしょう。

source: Showcasing the work your company is doing in its own open source projects is vitally important since developers cite their ability to work on interesting projects as the most effective way that recruiters can get their attention.
ja: デベロッパーは、雇用者がデベロッパーの興味を引くためのもっとも効果的な方法として「面白いプロジェクトに参加できること」を挙げているため、自社が携わっているオープンソース プロジェクトを示すことは企業にとって肝要となっています。

source: Sign up to get updates!
ja: アップデート情報取得のために、ぜひご登録ください。

source: Since they’re all ears, shouldn’t you pick up the megaphone?
ja: 情報を求めているのであれば、大々的に宣伝してみてはいかがでしょうか？

source: Since word of mouth is key to recruitment, this is a good place to fan all the goodness developers will talk about amongst themselves.
ja: 採用において口コミは非常に重要なので、デベロッパー同士の会話でこのような話題が取り上げられるように仕向けましょう。

source: Skilled open source developers can command a premium.
ja: 熟練したオープンソース デベロッパーは、平均以上の年収を要求することができます。

source: So it is, in the end, that all prosper.
ja: よって、最終的にはすべての関係者がメリットを享受できることになります。

source: So make it a team priority to get involved and stay involved as a company.
ja: 企業として、チームとして、長期的な取り組みを心がけてください。

source: So we do more occasional course-correction than we do formal training in open source processes.
ja: そのため、当社ではオープンソース プロセスに関するフォーマルな研修よりも、状況に応じた軌道修正を行うことの方が多くなります。

source: So while the first step in any developer recruitment strategy is sufficient economic incentive, it is only the opening bid.
ja: 以上のように、充分な経済的インセンティブを用意することはデベロッパー採用戦略の第一歩となりますが、これは入口にすぎません。

source: Software Architect
ja: ソフトウェア アーキテクト

source: Somewhat 18%
ja: やや同意する 18%

source: Somewhat 23%
ja: やや同意する 23%

source: Somewhat 30%
ja: やや同意する 30%

source: Sponsor and/or set up a booth at open source events
ja: オープンソース関連イベントでのスポンサーや、ブース出展。

source: Sponsoring an event and setting up a booth are two ways to clearly showcase your company, its support of the open source community, and developer opportunities to the very people you hope to recruit.
ja: スポンサーやブース出展は、貴社そのものに加えて、オープンソース コミュニティーをサポートする意欲やデベロッパーの活躍の機会を、採用の対象となる候補の方に直接あぴーすする絶好の手段です。

source: Startups, even those in stealth mode, can work on public open source projects to establish their cred and influence and attract talent even before they reveal their product offering.
ja: 自社の存在を極力明らかにしない「ステルスモード」にいるスタートアップであっても、公になっているオープンソース プロジェクトに参加し、製品・サービス群を公表する前の段階においても、信頼性や影響力を向上させることで人材を集めることが可能です。

source: Strongly 18%
ja: 強く同意する 18%

source: Strongly 20%
ja: 強く同意する 20%

source: Strongly 27%
ja: 強く同意する 27%

source: Strongly 34%
ja: 強く同意する 34%

source: Such opportunities are a top draw at companies where very experienced, well known, and talented engineers are plentiful.
ja: そのような機会は、経験と才能が豊富で著名なエンジニアを数多く抱える企業に優位性を与えます。

source: Take a strategic approach.
ja: 戦略的なアプローチの採用。

source: Taken as a whole, these five key strategies will not only help with hiring and retaining talented developers, but also help support your overall investment in open source for business strategy.
ja: 以下の5つの主要戦略は貴社の採用活動や才能ある人材の流出阻止だけでなく、事業戦略に寄与するオープンソース関連投資全体をサポートします。

source: Target projects your company works with now and/or may soon.
ja: 貴社が現在取り組んでいるプロジェクトや、近い将来取り組む可能性のあるプロジェクトに注力しましょう。

source: Tell prospective candidates if the role expects them to contribute to or manage open source projects.
ja: 候補者には、オープンソース プロジェクトへの貢献が求められるかを明示しましょう。

source: That is the way of open source and the unique value in both projects and developers.
ja: それがオープンソースの在り方であり、プロジェクトやデベロッパー独自の価値観でもあります。

source: That means you’re competing with companies all over the globe for the same pool of talent.
ja: つまり、貴社はこれらの人材の獲得に関して、世界中の企業と競合することになります。

source: That’s the beauty of open source.
ja: これが、オープンソースの素晴らしいところです。

source: The Jobs Report also found that 60 percent of hiring managers are seeking to hire open source talent, and half are looking for candidates holding certifications.
ja: Jobs Report の調査結果においても、採用担当者の60%がオープンソース系の人材を探しており、半数が何らかの認証を取得している人材を探していると回答しています。

source: The current average developer salary is $104,425, according to one recent report.
ja: 直近のあるレポートによると、現在の平均的なデベロッパーの年収は $104,425となっています。

source: The goal is to maintain and nourish each project’s commercial ecosystem which just happens to exist both inside and outside your company.
ja: 最終亭な目標は、貴社内から社外まで拡がる各プロジェクトの商業的なエコシステムを維持・発展させることです。

source: The good news is that your contributions also steer the open source projects in the direction your company needs.
ja: さらに、貴社の貢献はオープンソース プロジェクトを貴社が望む方向に進めることをも意味します。

source: The growing shortage of developers is well documented.
ja: デベロッパーの不足が年々悪化している状況について、各メディアで取り上げられています。

source: The key is in supporting their work within and without company boundaries.
ja: ここでのカギは、彼らの社内外双方での仕事をサポートすることにあります。

source: The people they meet will be more likely to adopt your projects if they hear about them from the developers who wrote the code.
ja: そのような場で出会った人は、コードを書いたデベロッパーから直接話が聞けるため、プロジェクトを導入してくれる可能性も高まります。

source: The situation is similar in high-scale big data analytics.
ja: 大規模なデータアナリティクスにおいても、状況は似ています。

source: The tools open source developers use are different, too, and generally require a different infrastructure or platform.
ja: オープンソースのデベロッパーが使用するツールも、他のものとは異なる場合が多く、一般的には別のインフラやプラットフォームを必要とします。

source: Their career path is fluid and driven by a continuous search for professional development and personal fulfillment – dubbed “respect” by Fournier and “recognition” by Osier-Mixon.
ja: デベロッパーのキャリアパスは流動的で、プロフェッショナルとしての成長や個人の充足感の飽くなき追及に突き動かされます。それを、上記のFournier氏は「敬意」と称し、Osier氏は「認知」と呼んでいます。

source: There are a variety of ways to incorporate training programs, from offering sessions designed to address specific open source concerns, such as license compliance, contribution processes and code mirroring, to apprenticeships where developers work alongside more experienced open source developers, to mentorships that provide help on sticky communal problems.
ja: ライセンスに関するコンプライアンス、貢献のプロセス、コードのミラーリングといったオープンソースにおけ特定の課題に関するセッションの開催から、経験豊富なデベロッパーを若手と結びつける徒弟制度、あるいはコミュニティー内のウェットな問題の解決をサポートするメンター制度まで、研修プログラムの導入には様々な方法があります。

source: There are many open source projects where employers aim to make specific contributions that advance their own work and products.
ja: 企業が自社の製品やサービスに寄与する特定の分野での貢献を目指すオープンソースプロジェクトは多数存在します。

source: There is no shortage of skilled developers to meet global demand
ja: 熟練したデベロッパーを、グローバルなレベルで充分に確保できている

source: There is now or will soon be a shortage of skilled developers
ja: 現在、もしくは近い将来に熟練したデベロッパーが不足する

source: These are all true but let’s be real, if you want to get people in the door, you need to create economic incentive.
ja: これらは決して間違ってはいませんが、現実を見つめることも大事です。経済的なインセンティブなしでは、優秀な人材の採用は困難となります。

source: These days, many developers are looking to build their open source skills.
ja: 昨今においては、デベロッパーは自らのオープンソース関連のスキルを向上させることを目指す傾向があるため、

source: These resources were created in partnership with the TODO (Talk Openly, Develop Openly) Group – the professional open source networking group at The Linux Foundation.
ja: これらのリソースは、Linux Foundation内のプロフェッショナル向けオープンソース ネットワーキング グループであるTODO (Talk Openly, Develop Openly) Groupと共同で作成されました。

source: They are also in great demand, and even more rare because they often work remotely due to the distributed nature of open source communities.
ja: 彼らは引く手数多であり、オープンソース コミュニティの分散された性質上、リモートで作業するため発見するのがとても困難です。

source: They can use the event to test an idea and to announce a new open source project.
ja: 実験的なアイデアの共有や新規オープンソース プロジェクトの発表の場として、イベントを活用しましょう。

source: They care about working on cool tech; they care about learning and growing.
ja: という神話があります。

source: They contribute on the company’s behalf to outside projects that you consider strategic to your business strategy and product development.
ja: 彼らは、会社の名において、戦略や製品開発に重要な外部プロジェクトに貢献し、

source: They don’t use your product, and they don’t necessarily see what you do, but they take a look at your open source projects and say ‘Hey, it looks like this company is actually involved in a lot of really neat stuff.’ It’s kind of a window for them to see the great engineering that’s going on inside of the company that they otherwise wouldn’t be able to see.”
ja: エンジニアはSalesforceのサービスを使用することはありませんし、何をしている会社なのかもわかりづらいかも知れませんが、関与しているオープンソース プロジェクトを見てもらうことにより、「面白い事に取り組んでいる会社だな」と思ってもらうことができます。社内で行われている、普段は見えづらいような素晴らしいエンジニアリングを見てもらうための窓のような役割を果たしています。」

source: They’ll want jobs that give them experience, or that leverage the experience they already have.
ja: 経験を得られる仕事や、取得した経験を発揮できる仕事を求めます。

source: This guide covers how organizations can recruit developers, or build internal talent, by building an open source culture, contributing to open source communities, and creating open source projects.
ja: 本ガイドは、企業・団体等における、オープンソース文化の醸成・オープンソースコミュニティへの貢献・オープンソース プロジェクトの立ち上げを通じたデベロッパーの採用や内部育成について触れていきます。

source: This is how your organization gains visibility, and credibility, in open source communities.
ja: これにより、オープンソース コミュニティー内における貴社の認知度や信頼性が高まります。

source: This is where your open source program comes in.
ja: ここで重要となるのが、記者のオープンソース プログラムです。

source: This is why a hedge fund manager can get a $6 million bonus and quit in a huff because they expected $8 million.
ja: だからこそ、6百万ドルのボーナスを得たヘッジファンドのマネージャーであっても、8百万ドルを期待していた場合、簡単に職を辞することがある。

source: This means the salary climb will likely continue over the foreseeable future, fueled by competitive necessity.
ja: これらの結果は、採用競争による賃金水準の上昇が今後しばらくの間、続いていくことを示唆しています。

source: This means you need to commit to contributing significant work rather than just going through the paces.
ja: これは、必要最低限のステップを踏むだけでなく、意味のある貢献にコミットする必要があるということです。

source: This reality is often disconcerting to the more structured corporate world which is better attuned to reaping a return on its investments – particularly in people — and commonly regards developers as interchangeable.
ja: 構造化された企業は、特に人材に関しては投資に対するリターンを求める傾向が強く、一般的にデベロッパーを「換えが効くもの」と捉えていることが多いため、上記の事実に直面した際、当惑することになります。

source: This respect should be earned, but once achieved, it must be consistently present.
ja: 敬意は従業員自身が勝ち取る必要がありますが、彼らが一度勝ち取った敬意に関しては、常に示してあげる必要があります。

source: This shift in philosophy around talent acquisition and retention is part of the culture shift that happens within an organization when it undergoes open source transformation.
ja: 人材の採用と維持に関連するこれらの哲学的な変化は、組織のオープンソースへの変革に伴う文化的な変化の一部です。

source: This speaks to the motivations of developers who contribute to open source.
ja: これは、オープンソースに貢献するデベロッパーのモチベーションについて重要な点を示唆しています。

source: This way, you can attract future contributors and future new hires.
ja: そうすることにより、将来的な貢献者や採用候補の募集にも貢献できます。

source: This work is licensed under a Creative Commons Attribution ShareAlike 4.0 International License.
ja: この情報は、Creative Commons Attribution ShareAlike 4.0 International Licenseによりライセンスされています。

source: This works to your advantage as a recruiter, but also against you as an employer.
ja: この状況は、貴社が採用者となる場合には有用ですが、人材流出を阻止する立場の場合は大きな課題となります。

source: To attract top talent, companies have to do more than hire a recruiter or place an ad on a popular job site.
ja: 企業がトップレベルのタレントを採用するためには、リクルーターを採用したり、有力な転職サイトに広告を掲示するだけでは不十分です。

source: To learn more, visit: todogroup.org
ja: 追加の情報に関しては、todogroup.orgをご覧ください。

source: To pass the test of time, your company will need to show real commitment beyond one person’s own passion.
ja: 長期に亘り信頼されるためには、一人の人間の意欲だけではなく、企業としてのコミットメントを示す必要があります。

source: Tools and practices. An open source culture can feel alien to the corporate world, but efforts to build it are not futile.
ja: ツールとプラクティス。一般的な企業社会においてオープンソース文化は異質に感じるかもしれませんが、それを醸成する努力は無駄になりません。

source: Train developers on open source
ja: デベロッパーにオープンソース分野の育成を実行する

source: Training is also a welcomed perk for developers seeking to improve their skills in open source.
ja: また、研修制度は、オープンソースのスキルを開発したいデベロッパーにとって魅力的な制度にもなります。

source: Usually the pushback you’ll get from companies is ‘if they make themselves so appealing, they can get poached.
ja: 企業は大抵「エンジニアが自らの市場価値を高めすぎると、他社にかすめ取られてしまう。」と反論する。

source: View All Guides »
ja: すべてのガイドを見る

source: We absolutely have to have open source talent in the company to drive what we’re trying to do moving forward.”
ja: 我々の今後の事業を推し進める上で、社内にオープンソースの人材を確保することは不可欠になります。」

source: When to recruit vs. train
ja: 採用か育成か？

source: While there is no doubt that good code and community leadership builds a reputation that attracts talent, recruitment efforts must go beyond this level of developer engagement.
ja: 良質なコードやコミュニティー内におけるリーダーシップが採用に役立つ評判に寄与することは間違いありませんが、採用活動においてはさらなるデベロッパーとのエンゲージメントが求められます。

source: While traditional recruiters are still used, human resources and recruiting teams are looking beyond the traditional places for developers.
ja: 従来型のリクルーターも活用されているものの、人事部門や採用チームは、デベロッパーを求めて他の場所にも目を向けています。

source: Why you need a recruitment strategy
ja: 採用戦略の重要性

source: Without it, respect and recognition cannot exist.
ja: これがなくては、敬意や認知は存在し得ない。

source: Working alongside great developers in high-visibility positions and projects is a big score, too.
ja: 認知度の高いプロジェクトや立ち位置において偉大なデベロッパーと協業することも効果的です。

source: Yahoo, now a part of Oath, is renowned for its work in other high-scale computing projects, and attracts developers who are interested in developing their big data skills.
ja: 現在はOathの一部であるYahooは、他の大規模演算プロジェクトへの関与で有名であり、 ビッグデータ関連のスキルを伸ばしたいデベロッパーにとって魅力的な雇用者です。

source: Yes, it’s that important.
ja: それだけ重要だ、ということを示す事例です。

source: Yet, recruiting from open source communities is often a necessity because that is where one finds experienced developers for that project.
ja: 一方で、各プロジェクトの経験者が存在するという意味では、オープンソース コミュニティーからの採用は必然でもあります。

source: You can structure any of these formally or informally.
ja: これらはいずれもフォーマル・インフォーマル双方の形式で構築可能ですが、

source: You lead and build trust by making your own code open source, creating small pilot projects and iterating on your successes.
ja: リーダーとして信頼を獲得するためには、自社のコードをオープンソース化し、小さなパイロットプロジェクトを立ち上げ、成功体験を反復します。

source: You need to put training together and start working with people in the company to begin to groom them for that kind of leadership.
ja: 研修を策定し、社員をリーダーに育て上げる必要があります。

source: You want to become a place where people are free to be open and contribute to open source and to make themselves more valuable as individuals.
ja: オープンな活動を支持し、オープンソースへの貢献を通じてエンジニアが自身の市場価値を高められるような職場を目指さなければならないが、

source: Your hiring and retention strategy is most meaningful to your company and its developers when it addresses both internal and external talent.
ja: 貴社の採用ならびに雇用維持に係る戦略は、社内外双方の人材を念頭に置いた際に、貴社とそのデベロッパーにとってもっとも効果的なものとなります。

source: Your open source program can become one of your most effective recruiting tools.
ja: 貴社のオープンソースプログラムは、貴社の最も強力な採用ツールとなり得ます。

source: Your single most passionate open source leader could leave at any time, and you’d have to start over from scratch.
ja: 唯一の意欲的なオープンソース リーダーが退職してしまった場合、企業としてのプレゼンス確立に関しては、一からやり直しとなってしまうので、

source: You’ll also want to learn from these skilled developers and develop internal guidance so that you can help other open source developers you hire or train to succeed in becoming influential in open source communities too.
ja: また、これらの優秀なデベロッパーから学び、社内でガイダンスを作成することで、採用あるいは育成した他のオープンソース デベロッパーが各コミュニティーで影響力を行使できるようにすることも重要です。

source: You’ll also want to use training to proactively groom successors for key project contributors so natural attrition and turnover doesn’t harm your company.
ja: 従業員の離職により生じるリスクを回避するために、主要プロジェクトへの貢献者の後継者育成の観点からも、研修による積極的な育成が重要になります。

source: You’ll want to build that into your recruitment and retention strategy.
ja: これは、採用や流出阻止の戦略に組み込むことをお勧めします。

source: high schools (13.2%) offer AP computer science classes, according to this same report, relief for the developer shortage isn’t likely to appear anytime soon.
ja: 米国の高校の1/8程度（13.2%）でしかAP（高校で受講できる大学レベルの授業）のコンピューターサイエンスの授業を提供していないため、需要過多の状況が近い将来において解消されることは期待できない状況にあります。

source: “A lot of how you recruit should center on thinking consciously about how you change the perception of the open source community on what your company is about.”
ja: 「採用の方法論は、オープンソース コミュニティーが持つ貴社に対する印象を如何に改善するかを意識的に考えることで導き出されるべきです。」

source: “Domain expertise and leadership in open source can sometimes take quite a long time at established companies.
ja: 「オープンソースの特定ドメインにおける専門性やリーダーシップの確立は、成熟した企業においてはかなりの時間がかかる場合があります。

source: “For those who have never really worked on open source projects or with open source communities, we help them through the process of understanding all the things they shouldn’t do, all the things that can get them in trouble legally and communally, and all the things they should do, like how to work with people at other companies who are working on the same project but with slightly different goals, basically how to manage an external community.”
ja: 「オープンソースのコミュニティーやプロジェクトに関与したことがない企業に関しては、法的あるいはコミュニティー的に問題となる可能性のある「やってはいけないこと」や、微妙に目的が異なる類似プロジェクトを実行している企業との協業などの「やるべきこと」など、要は外部コミュニティーの管理について理解を促す支援しています。」

source: “If you are a company like Salesforce, it’s not always obvious to engineers why they might want to work for your company.
ja: 「例えばSalesforceのような会社である場合、エンジニアにとってどのような魅力がある雇用者であるのか、アピールが難しい場合があります。

source: “In the Yocto Project, several developers and at least two members of the governance have worked on YP from more than one company.
ja: 「Yoctoプロジェクトにおいて、数名のデベロッパーと、少なくとも2名のガバナンスチームメンバーが、複数の異なる会社から同プロジェクトに従事しました。

source: “Money is important, but it functions as a representation of recognition, not value.
ja: 「お金は大事だが、これは価値ではなく認知の指標として受け止められている。
